import * as tauri from '@tauri-apps/api'

const screenSize = [ 
  /*[名稱name,
        寬width,
        高height,
        資訊description
    ]
    ["",
        ,
        ,
        [

        ]
    ],

  */

    ["4320p (8k)",
        7680,
        4320,
        [
            "8k畫質用來玩文字RPG會不會太離譜"
        ]
    ],

    ["3240 (6k)",
        5760,
        3240,
        [
            "6k...",
            "好冷門的解析度",
            "查資料前我都不知道有這種解析度"
        ]
    ],

    ["2160p (4k)",
        3840,
        2160,
        [
            "你看是3k 👇"
        ]
    ],

    ["1620p (3k)",
        2880,
        1620,
        [
            "3k - 一個卡在2k和4k中間的尷尬解析度"
        ]
    ],

    ["1440p (2k)",
        2560,
        1440,
        [
            "你看是3k 👆"
        ]
    ],

    ["1080p (HD)",
        1920,
        1080,
        [
            "主流且通用",
            "全螢幕也是個不錯的選擇呢"
        ]
    ],

    ["720p (HD)",
        1280,
        720,
        [

        ]
    ],

    ["480p (SD)",
        854,
        480,
        [

        ]
    ],

    ["360p (SD)",
        640,
        360,
        [

        ]
    ],
]